app/controllers/admins_controller.rb

  def index
    @user_id = session[:okta_user]
    @admins  = Admin.all
---
SELECT "admins".* FROM "admins"

  def edit
    @info = Admin.find(params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @info = Admin.new(params[:admin])

    if @info.save
---
INSERT INTO "admins" ("contact_no", "email", "name", "status") VALUES (?, ?, ?, ?)  [["contact_no", "8765432100"], ["email", "apurvagupta@gmail.com"], ["name", "neeli"], ["status", false]]

  def update
    @info = Admin.find(params[:id])
    if @info.update_attributes(params[:admin])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "admins" SET "name" = 'cooga', "email" = 'cooga@gmail.com', "status" = 'f' WHERE "admins"."id" = 2

  def destroy
    @info = Admin.find(params[:id])
    @info.destroy
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 3]]