app/controllers/cab_requests_controller.rb

SELECT email FROM "admins" WHERE "admins"."status" = project35m (0.1ms)  SELECT email FROM "vendors" WHERE "vendors"."status" = 't'
SELECT 1 AS one FROM "admins" WHERE "admins"."email" = 'narangparaslk@gmail.com' LIMIT 1
SELECT name FROM "admins"
SELECT email FROM "vendors" WHERE "vendors"."order" = 1
---
      @destination             = 'Guest House'
    end

    admin_emails  = Admin.where(status: true).pluck(:email)
    if admin_emails.include? requester
      requester = ""
    end
    vendor_email = Vendor.where(order: 1).pluck(:email).first

INSERT INTO "cab_requests" ("comments", "contact_no", "created_at", "destination", "other_travellers", "pick_up_date_time", "requester", "source", "status", "traveler_name", "updated_at", "vehicle_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?projectts", "Help me pass test"], ["contact_no", "1234567890"], ["created_at", Mon, 30 Dec 2013 15:38:41 UTC +00:00], ["destination", "hell"], ["other_travellers", "Jack, Jill"], ["pick_up_date_time", Wed, 01 Jan 2014 15:38:17 UTC +00:00], ["requester", "obama"], ["source", "Dilshad Garden"], ["status", "Pending"],project", "osama"], ["updated_at", Mon, 30 Dec 2013 15:38:41 UTC +00:00], ["vehicle_type", "Indigo"]]
---
    if vendor_email == nil
      render template: '_message'

    elsif @cab_request.save

SELECT "cab_requests".* FROM "cab_requests" WHERE "cab_requests"."requester" = 'obamproject 200 OK in 3ms (Views: 0.9ms | ActiveRecord: 0.2ms)
---
  def show
    @cab_requests      = CabRequest.where(requester: session[:cas_user]).reverse