app/controllers/cab_requests_controller.rb

SELECT email FROM "vendors" WHERE "vendors"."status" = 't'
---
    if admin_emails.include? requester
      requester = ""
    end
    vendor_email = Vendor.where(status: true).pluck(:email).first