app/controllers/support_centers_controller.rb

SELECT contact_no FROM "admins" WHERE "admins"."status" = 't'
SELECT "admins".* FROM "admins"
SELECT "vendors".* FROM "vendors" WHERE "vendors"."order" = 1 LIMIT 1
---
  def index
    @admins_name_arr = Admin.where(status: true).pluck(:name)
    @admins_contact_no_arr = Admin.where(status: true).pluck(:contact_no)
    @admins_email_arr = Admin.where(status: true).pluck(:email)
    @admins_name = ""
    @admins_contact_no = ""
    @admins_email = ""
    @admins_name_arr.each do |admin_name|
      @admins_name = @admins_name + admin_name + " , "
    end
    @admins_contact_no_arr.each do |admin_contact|
      @admins_contact_no = @admins_contact_no + admin_contact + " , "
    end
    @admins_email_arr.each do |admin_email|
      @admins_email = @admins_email + admin_email + " , "
    end
    @admins_name = @admins_name[0..@admins_name.length - 3]
    @admins_contact_no = @admins_contact_no[0..@admins_contact_no.length - 3]
    @admins_email = @admins_email[0..@admins_email.length - 3]
    @vendor = Vendor.where(order: 1).first

SELECT "admins".* FROM "admins"
UPDATE "admins" SET "status" = 'f' WHERE "admins"."id" = 1
SELECT "admins".* FROM "admins" WHERE "admins"."name" = 'riya ' LIMIT 1
---
  def update
    if params[:admin] == "All"
      @admins = Admin.all
      @admins.each do |admin|
        admin.update_attribute(:status, 'true')
      end
    else
      admin = Admin.where(name: params[:admin]).first

SELECT "cab_requests".* FROM "cab_requests" WHERE ("cab_requests"."created_at" BETWEEN '2013-12-31 18:30:00.000000' AND '2014-01-24 18:30:00.000000') ORDER BY created_at
SELECT "cab_requests".* FROM "cab_requests" WHERE ("cab_requests"."pick_up_date_time" BETWEEN '2013-12-29 18:30:00.000000' AND '2014-01-01 18:30:00.000000') ORDER BY pick_up_date_time
SELECT "cab_requests".* FROM "cab_requests"
---
  def show
    if params[:from]
      from_date = Time.parse(date_time_parser(params[:from], '00:00:00'))
      to_date = Time.parse(date_time_parser(params[:to], '00:00:00')).tomorrow()
    end
    if (params[:filter_by] == "Booking Date")
      @cab_requests = CabRequest.where(created_at: (from_date..to_date)).order(:created_at)
    elsif (params[:filter_by] == "Travel Date")
      @cab_requests = CabRequest.where(pick_up_date_time: (from_date..to_date)).order(:pick_up_date_time)
    else
      @cab_requests ||= CabRequest.all.reverse