app/controllers/vendor_response_controller.rb

  def submit_response
    @cab_request = CabRequest.find(params[:id])
    logger.info('VENDOR ID IS: '+@cab_request.requested_vendor.to_s)
    if(@cab_request.requested_vendor.to_s == params[:vendor_id])
      render partial: 'vendor_response/index'

      requester = @cab_request.requester + '@thoughtworks.com'

      admin_emails  = Admin.where(status: true).pluck(:email)
      if admin_emails.include? requester
        requester = ""
      end

      refusing_vendor_email = Vendor.where(status: true).where(id: params[:vendor_id]).pluck(:email).first
      vendor_email = Vendor.where(status: true).where("id > ?", params[:vendor_id]).pluck(:email).first
      vendor_id = Vendor.where(status: true).where("id > ?", params[:vendor_id]).pluck(:id).first
      @cab_request.update_column('requested_vendor', vendor_id)
---
SELECT "cab_requests".* FROM "cab_requests" WHERE "cab_requests"."id" = ? LIMIT 1  [["id", "2"]]
SELECT email FROM "admins" WHERE "admins"."status" = 't'
SELECT email FROM "vendors" WHERE "vendors"."status" = 't' AND "vendors"."id" IS NULL
UPDATE "cab_requests" SET "requested_vendor" = 2 WHERE "cab_requests"."id" = 14