app/controllers/vendors_controller.rb

SELECT "vendors".* FROM "vendors"
---
  def index
    @vendors = Vendor.all.sort_by{|vendor| vendor.order}

SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @info = Vendor.find(params[:id])

INSERT INTO "vendors" ("contact_no", "email", "name", "status") VALUES (?, ?, ?, ?)  [["contact_no", "9039499999"], ["email", "apurva@gmail.com"], ["name", "dhidu"], ["status", false]]
---
  def create
    @info = Vendor.new(params[:vendor])
    @info.order = Vendor.all.count + 1
    if @info.save

SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "vendors" SET "contact_no" = '1234567890' WHERE "vendors"."id" = 3
---
  def update
    @info = Vendor.find(params[:id])

    if @info.update_attributes(params[:vendor])

SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "vendors" WHERE "vendors"."id" = ?  [["id", 3]]
---
  def destroy
    @info = Vendor.find(params[:id])
    @info.destroy